wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
            } else if(pauseHoldStarted) {
                unsigned long t = millis();
                if(t - pauseHoldStartstamp > OF_Prefs::settings[OF_Const::holdToPauseLength]) {
                    // MAKE SURE EVERYTHING IS DISENGAGED:
                    OF_FFB::FFBShutdown();
		            Keyboard.releaseAll();
                    AbsMouse5.releaseAll();
                    FW_Common::offscreenBShot = false;
                    FW_Common::buttonPressed = false;
	    	        FW_Common::pauseModeSelection = PauseMode_Calibrate;
                    FW_Common::SetMode(FW_Const::GunMode_Pause);
                    FW_Common::buttons.ReportDisable();
                    return;
                }
            }
        } else {
            if(FW_Common::buttons.pressedReleased == FW_Const::EnterPauseModeBtnMask || FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Home) {
                // MAKE SURE EVERYTHING IS DISENGAGED:
                OF_FFB::FFBShutdown();
		        Keyboard.releaseAll();
                AbsMouse5.releaseAll();
                FW_Common::offscreenBShot = false;
                FW_Common::buttonPressed = false;
		        FW_Common::SetMode(FW_Const::GunMode_Pause);
                FW_Common::buttons.ReportDisable();
                return;
            }
        }
        #else  // if we're using dual cores, we just check if the gunmode has been changed by the other thread.
        if(FW_Common::gunMode != FW_Const::GunMode_Run) {
            Keyboard.releaseAll();
            AbsMouse5.releaseAll();
            return;
        }
        #endif // ARDUINO_ARCH_RP2040 || DUAL_CORE

#ifdef DEBUG_SERIAL
        ++frameCount;
        OF_Serial::PrintDebugSerial();
#endif // DEBUG_SERIAL
    }
}

// from Samco_4IR_Test_BETA sketch
// for use with the Samco_4IR_Processing_Sketch_BETA Processing sketch
void ExecRunModeProcessing()
{
    FW_Common::buttons.ReportDisable();

    #ifdef USES_DISPLAY
        FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_IRTest);
    #endif // USES_DISPLAY

    for(;;) {
        FW_Common::buttons.Poll(1);

        if(Serial.available()) {
            #ifdef USES_DISPLAY
                FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Docked);
            #endif // USES_DISPLAY

            OF_Serial::SerialProcessingDocked();
        }

        if(FW_Common::runMode != FW_Const::RunMode_Processing)
            return;

        if(FW_Common::irPosUpdateTick) {
            FW_Common::irPosUpdateTick = 0;
            FW_Common::GetPosition();
        }
    }
}

// For use with the OpenFIRE app when it connects to this board.
void ExecGunModeDocked()
{
    FW_Common::buttons.ReportDisable();

    if(FW_Common::justBooted) {
        // center the joystick so RetroArch/Windows doesn't throw a hissy fit about uncentered joysticks
        delay(250);  // Exact time needed to wait seems to vary, so make a safe assumption here.
        Gamepad16.releaseAll();
    }

    #ifdef LED_ENABLE
        OF_RGB::LedUpdate(127, 127, 255);
    #endif // LED_ENABLE

    unsigned long tempChecked = millis();
    unsigned long aStickChecked = millis();
    uint8_t aStickDirPrev;

    {
        char buf[64];
        int pos = sprintf(&buf[0], "%.1f"
                                    #ifdef GIT_HASH
                                    "-%s"
                                    #endif // GIT_HASH
                                    , OPENFIRE_VERSION
                                    #ifdef GIT_HASH
                                    ,GIT_HASH
                                    #endif // GIT_HASH
                          );
        buf[pos++] = OF_Const::serialTerminator;
        pos += sprintf(&buf[pos], "%s", OPENFIRE_CODENAME);
        buf[pos++] = OF_Const::serialTerminator;
        pos += sprintf(&buf[pos], "%s", OPENFIRE_BOARD);
        buf[pos++] = OF_Const::serialTerminator;
        buf[pos++] = OF_Prefs::currentProfile;
        buf[pos++] = OF_Const::serialTerminator;
        memcpy(&buf[pos], &OF_Prefs::usb.devicePID, sizeof(OF_Prefs::USBMap_t::devicePID));
        pos += 2;
        pos += sprintf(&buf[pos], "%s", OF_Prefs::usb.deviceName);
        if(FW_Common::camNotAvailable) {
            buf[pos++] = OF_Const::serialTerminator;
            buf[pos++] = OF_Const::sError;
        }
        Serial.write(buf, pos+1);
        Serial.flush();
    }

    for(;;) {
        FW_Common::buttons.Poll(1);

        if(Serial.available())
            OF_Serial::SerialProcessingDocked();

        if(!FW_Common::dockedSaving) {
            if(FW_Common::buttons.pressed) {
                for(uint8_t i = 0; i < ButtonCount; i++)
                    if(bitRead(FW_Common::buttons.pressed, i)) {
                        const char buf[] = {OF_Const::sBtnPressed, i};
                        Serial.write(buf, 2);
                    }
            }

            if(FW_Common::buttons.released) {
                for(uint8_t i = 0; i < ButtonCount; i++)
                    if(bitRead(FW_Common::buttons.released, i)) {
                        const char buf[] = {OF_Const::sBtnReleased, i};
                        Serial.write(buf, 2);
                    }
            }

            OF_FFB::TemperatureUpdate();
            unsigned long currentMillis = millis();
            if(currentMillis - tempChecked >= 1000) {
                if(OF_Prefs::pins[OF_Const::tempPin] >= 0) {
                    const char buf[] = {OF_Const::sTemperatureUpd, OF_FFB::temperatureCurrent};
                    Serial.write(buf, 2);
                }

                tempChecked = currentMillis;
            }
            
            if(FW_Common::analogIsValid) {
                if(currentMillis - aStickChecked >= 100) {
                    aStickChecked = currentMillis;

                    // TODO: replace with just sending coords normally instead of an approximated cardinal.
                    uint16_t analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
                    uint16_t analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
                    
                    char buf[5] = {OF_Const::sAnalogPosUpd};
                    memcpy(&buf[1], (uint8_t*)&analogValueX, sizeof(uint16_t));
                    memcpy(&buf[3], (uint8_t*)&analogValueY, sizeof(uint16_t));
                    Serial.write(buf, sizeof(buf));
                }
            }
        }

        if(FW_Common::gunMode != FW_Const::GunMode_Docked)
            return;

        if(FW_Common::runMode == FW_Const::RunMode_Processing)
            ExecRunModeProcessing();
    }
}

