wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
// wait up to given amount of time for no buttons to be pressed before setting the mode
void SetModeWaitNoButtons(const FW_Const::GunMode_e &newMode, const unsigned long &maxWait)
{
    unsigned long ms = millis();
    while(FW_Common::buttons.debounced && (millis() - ms < maxWait))
        FW_Common::buttons.Poll(1);

    FW_Common::SetMode(newMode);
}

// Handles events when trigger is pulled/held
void TriggerFire()
{
    if(!FW_Common::buttons.offScreen &&                                     // Check if the X or Y axis is in the screen's boundaries, i.e. "off screen".
    !FW_Common::offscreenBShot) {                                           // And only as long as we haven't fired an off-screen shot,
        if(!FW_Common::buttonPressed) {
            if(FW_Common::buttons.analogOutput)
                Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3); // No reason to handle this ourselves here, but eh.
            else AbsMouse5.press(MOUSE_LEFT);                     // We're handling the trigger button press ourselves for a reason.

            FW_Common::buttonPressed = true;                                // Set this so we won't spam a repeat press event again.
        }

        if(!bitRead(FW_Common::buttons.debounced, 3) &&                     // Is the trigger being pulled WITHOUT pressing Start & Select?
        !bitRead(FW_Common::buttons.debounced, 4))
            OF_FFB::FFBOnScreen();
    } else {  // We're shooting outside of the screen boundaries!
        if(!FW_Common::buttonPressed) {  // If we haven't pressed a trigger key yet,
            if(!OF_FFB::triggerHeld && FW_Common::offscreenButton) {  // If we are in offscreen button mode (and aren't dragging a shot offscreen)
                if(FW_Common::buttons.analogOutput)
                    Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportCode3);
                else AbsMouse5.press(MOUSE_RIGHT);

                FW_Common::offscreenBShot = true;                     // Mark we pressed the right button via offscreen shot mode,
            } else {  // Or if we're not in offscreen button mode,
                if(FW_Common::buttons.analogOutput)
                    Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
                else AbsMouse5.press(MOUSE_LEFT);
            }

            FW_Common::buttonPressed = true;                      // Mark so we're not spamming these press events.
        }
        OF_FFB::FFBOffScreen();
    }
    OF_FFB::triggerHeld = true;                                   // Signal that we've started pulling the trigger this poll cycle.
}

// Handles events when trigger is released
void TriggerNotFire()
{
    OF_FFB::triggerHeld = false;                                    // Disable the holding function
    if(FW_Common::buttonPressed) {
        if(FW_Common::offscreenBShot) {                                // If we fired off screen with the FW_Common::offscreenButton set,
            if(FW_Common::buttons.analogOutput)
                Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportCode3);
            else AbsMouse5.release(MOUSE_RIGHT);             // We were pressing the right mouse, so release that.

            FW_Common::offscreenBShot = false;
        } else {                                            // Or if not,
            if(FW_Common::buttons.analogOutput)
                Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
            else AbsMouse5.release(MOUSE_LEFT);              // We were pressing the left mouse, so release that instead.
        }
        
        FW_Common::buttonPressed = false;
    }
    
    OF_FFB::FFBRelease();
}

#ifdef USES_ANALOG
void AnalogStickPoll()
{
    unsigned int analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
    unsigned int analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
    
    // Analog stick deadzone should help mitigate overwriting USB commands for the other input channels.
    if((analogValueX < ANALOG_STICK_DEADZONE_X_MIN || analogValueX > ANALOG_STICK_DEADZONE_X_MAX) ||   // 696969 per calibrazione
       (analogValueY < ANALOG_STICK_DEADZONE_Y_MIN || analogValueY > ANALOG_STICK_DEADZONE_Y_MAX)) {   // 696969 per calibrazione
          Gamepad16.moveStick(analogValueX, analogValueY);
    } else {
        // Duplicate coords won't be reported, so no worries.
        Gamepad16.moveStick(ANALOG_STICK_CENTER_X, ANALOG_STICK_CENTER_Y);  // 696969 per calibrazione
    }
}
#endif // USES_ANALOG

#ifdef MAMEHOOKER
// Trigger execution path while in Serial handoff mode - pulled
void TriggerFireSimple()
{
    if(!FW_Common::buttonPressed &&                             // Have we not fired the last cycle,
    OF_Serial::offscreenButtonSerial && FW_Common::buttons.offScreen) {    // and are pointing the gun off screen WITH the offScreen button mode set?    
        if(FW_Common::buttons.analogOutput)
            Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportCode3);
	      else AbsMouse5.press(MOUSE_RIGHT);

        FW_Common::offscreenBShot = true;                       // Mark we pressed the right button via offscreen shot mode,
        FW_Common::buttonPressed = true;                        // Mark so we're not spamming these press events.
    } else if(!FW_Common::buttonPressed) {                      // Else, have we simply not fired the last cycle?
	      if(FW_Common::buttons.analogOutput) 
            Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
	      else AbsMouse5.press(MOUSE_LEFT);

        FW_Common::buttonPressed = true;                        // Set this so we won't spam a repeat press event again.
    }
}

// Trigger execution path while in Serial handoff mode - released
void TriggerNotFireSimple()
{
    if(FW_Common::buttonPressed) {                              // Just to make sure we aren't spamming mouse button events.
        if(FW_Common::offscreenBShot) {                         // if it was marked as an offscreen button shot,
            if(FW_Common::buttons.analogOutput)
                Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportCode3);
	          else AbsMouse5.release(MOUSE_RIGHT);
            FW_Common::offscreenBShot = false;                  // And set it off.
        } else {                                     // Else,
            if(FW_Common::buttons.analogOutput)
                Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
	          else AbsMouse5.release(MOUSE_LEFT);
        }
        FW_Common::buttonPressed = false;                       // Unset the button pressed bit.
    }
}
#endif // MAMEHOOKER


void SendEscapeKey()
{
    Keyboard.press(KEY_ESC);  // 696969 non corrisponde a HID_KEY_ESCAPE, ma lasciamo come impostato, boh ?
    delay(20);  // wait a bit so it registers on the PC.
    Keyboard.release(KEY_ESC); // 696969 non corrisponde a HID_KEY_ESCAPE, ma lasciamo come impostato, boh ?
}

