wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
    #ifdef USES_DISPLAY
        FW_Common::OLED.PauseProfileUpdate(profileModeSelection, OF_Prefs::profiles[0].name, OF_Prefs::profiles[1].name, OF_Prefs::profiles[2].name, OF_Prefs::profiles[3].name);
    #endif // USES_DISPLAY

    Serial.print("Selecting profile: ");
    Serial.println(OF_Prefs::profiles[profileModeSelection].name);

    return;
}

void SelectCalProfileFromBtnMask(const uint32_t &mask)
{
    // only check if buttons are set in the mask
    if(!mask)
        return;

    for(uint8_t i = 0; i < PROFILE_COUNT; ++i) {
        if(bitRead(mask, i)) {
            FW_Common::SelectCalProfile(i);
            return;
        }
    }
}

void CycleIrSensitivity()
{
    uint8_t sens = FW_Common::irSensitivity;
    if(FW_Common::irSensitivity < DFRobotIRPositionEx::Sensitivity_Max)
        sens++;
    else sens = DFRobotIRPositionEx::Sensitivity_Min;

    FW_Common::SetIrSensitivity(sens);
}

void IncreaseIrSensitivity()
{
    uint8_t sens = FW_Common::irSensitivity;
    if(FW_Common::irSensitivity < DFRobotIRPositionEx::Sensitivity_Max) {
        sens++;
        FW_Common::SetIrSensitivity(sens);
    }
}

void DecreaseIrSensitivity()
{
    uint8_t sens = FW_Common::irSensitivity;
    if(FW_Common::irSensitivity > DFRobotIRPositionEx::Sensitivity_Min) {
        sens--;
        FW_Common::SetIrSensitivity(sens);
    }
}

/*
// applies loaded screen calibration profile
bool SelectCalPrefs(unsigned int profile)
{
    if(profile >= PROFILE_COUNT) {
        return false;
    }

    // if center values are set, assume profile is populated
    if(OF_Prefs::profiles[profile].xCenter && OF_Prefs::profiles[profile].yCenter) {
        xCenter = OF_Prefs::profiles[profile].xCenter;
        yCenter = OF_Prefs::profiles[profile].yCenter;
        
        // 0 scale will be ignored
        if(OF_Prefs::profiles[profile].xScale) {
            xScale = CalScalePrefToFloat(OF_Prefs::profiles[profile].xScale);
        }
        if(OF_Prefs::profiles[profile].yScale) {
            yScale = CalScalePrefToFloat(OF_Prefs::profiles[profile].yScale);
        }
        return true;
    }
    return false;
}
*/

// Pause mode offscreen trigger mode toggle widget
// Blinks LEDs (if any) according to enabling or disabling this obtuse setting for finnicky/old programs that need right click as an offscreen shot substitute.
void OffscreenToggle()
{
    FW_Common::FW_Common::offscreenButton = !FW_Common::FW_Common::offscreenButton;
    if(FW_Common::offscreenButton) {                                         // If we turned ON this mode,
        Serial.println("Enabled Offscreen Button!");

        #ifdef LED_ENABLE
            OF_RGB::SetLedPackedColor(WikiColor::Ghost_white);            // Set a color,
        #endif // LED_ENABLE

        #ifdef USES_RUMBLE
            #ifdef ARDUINO_ARCH_ESP32   // 696969 per ESP32
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 255);                        // Set rumble on
                delay(125);                                           // For this long,
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);                         // Then flick it off,
                delay(150);                                           // wait a little,
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 255);                        // Flick it back on
                delay(200);                                           // For a bit,
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);                         // and then turn it off,          
            #else // rp2040
                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], HIGH);                        // Set rumble on
                delay(125);                                           // For this long,
                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);                         // Then flick it off,
                delay(150);                                           // wait a little,
                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], HIGH);                        // Flick it back on
                delay(200);                                           // For a bit,
                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);                         // and then turn it off,
            #endif
        #else
            delay(450);
        #endif // USES_RUMBLE

        #ifdef LED_ENABLE
            OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);// And reset the LED back to pause mode color
        #endif // LED_ENABLE

        return;
    } else {                                                      // Or we're turning this OFF,
        Serial.println("Disabled Offscreen Button!");

        #ifdef LED_ENABLE
            OF_RGB::SetLedPackedColor(WikiColor::Ghost_white);            // Just set a color,
            delay(150);                                           // Keep it on,
            OF_RGB::LedOff();                                             // Flicker it off
            delay(100);                                           // for a bit,
            OF_RGB::SetLedPackedColor(WikiColor::Ghost_white);            // Flicker it back on
            delay(150);                                           // for a bit,
            OF_RGB::LedOff();                                             // And turn it back off
            delay(200);                                           // for a bit,
            OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);// And reset the LED back to pause mode color
        #endif // LED_ENABLE

        return;
    }
}

// Pause mode autofire factor toggle widget
// Does a test fire demonstrating the autofire speed being toggled
void AutofireSpeedToggle()
{
    switch (OF_Prefs::settings[OF_Const::autofireWaitFactor]) {
        case 2:
            OF_Prefs::settings[OF_Const::autofireWaitFactor] = 3;
            Serial.println("Autofire speed level 2.");
            break;
        case 3:
            OF_Prefs::settings[OF_Const::autofireWaitFactor] = 4;
            Serial.println("Autofire speed level 3.");
            break;
        case 4:
            OF_Prefs::settings[OF_Const::autofireWaitFactor] = 2;
            Serial.println("Autofire speed level 1.");
            break;
    }
    #ifdef LED_ENABLE
        OF_RGB::SetLedPackedColor(WikiColor::Magenta);                    // Set a color,
    #endif // LED_ENABLE

    #ifdef USES_SOLENOID
        for(byte i = 0; i < 5; i++) {                             // And demonstrate the new autofire factor five times!
            digitalWrite(OF_Prefs::pins[OF_Const::solenoidPin], HIGH);
            delay(OF_Prefs::settings[OF_Const::solenoidFastInterval]);
            digitalWrite(OF_Prefs::pins[OF_Const::solenoidPin], LOW);
            delay(OF_Prefs::settings[OF_Const::solenoidFastInterval] * OF_Prefs::settings[OF_Const::autofireWaitFactor]);
        }
    #endif // USES_SOLENOID

    #ifdef LED_ENABLE
        OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);    // And reset the LED back to pause mode color
    #endif // LED_ENABLE
}

